print('-'*25,"fun1()输出",'-'*25)
def fun1(a,b,c):            #必需参数
    #功能是返回所给参数的内容
    return a,'是行政楼',b,'是图书馆',c,'是教学楼'
print(fun1(b = '逸夫楼',c = '文泰楼',a = '中原楼'))     #按照b->a->c顺序输出，若不输入参数则报错

print('-'*25,"fun2()输出",'-'*25)

def fun2(a = '中原楼',b = '逸夫楼',c = '文泰楼'):    #默认参数
    #功能同上，但全是默认参数
    return a, '是行政楼', b, '是图书馆', c, '是教学楼'
print(fun2())                                           #若不输入参数，按照默认参数输出

print('-'*25,"fun3()输出",'-'*25)

def fun3(*a):               #不定长参数
    #功能是遍历输出所有输入参数
    for i in a:
        print(i)
    return;
a = "中原楼";b = "逸夫楼";c = "文泰楼"
print(fun3(a,b,c))                              #输出参数a,b,c

print('-'*25,"fun4()输出",'-'*25)